# 初学者向けPandas100本ノックver1.0.6
##### Shift + Enter で各セルのコードが実行されます
・print(ans[ 問題番号 ]) で回答コード例を表示  
・Python3エンジニア認定データ分析試験にも沿った問題内容   
・Pandasの各メソッドの説明は以下のサイトが分かりやすいです  
 　[note.nknk.me](https://note.nkmk.me/pandas/)  
・"Data for Titanic passengers" from [VANDERBILT UNIVERSITY](https://biostat.app.vumc.org/wiki/Main/DataSets)  
  
作成日:2020年9月24日  
最終更新日:2021年9月26日  
再配布・改編不可  
作成者：[kunishou](https://qiita.com/kunishou)

In [1]:
# Shift + Enterで題材データ、回答コードを読み込んで下さい

import pandas as pd
import glob

#題材データをdfに読み込み(タイタニック号の乗客データ、テストの点数データ 等)
def initialize1():
    df = pd.read_csv('../input/titanic3.csv')
    return df

def initialize2():
    df = pd.read_csv('../input/data1.csv')
    return df

df = initialize1()
df2 = initialize2()
df3 = pd.read_csv('../input/data1_2.csv')
df4 = pd.read_csv('../input/data1_3.csv')
df5 = pd.read_csv('../input/data2.csv',encoding='cp932')

#回答コードをansリストに格納
path = sorted(glob.glob('../input/a_' + '*.txt'))

ans = []

for _ in range(len(path)):
    with open(path[_], 'r',encoding='utf-8') as f:
        ans.append(f.read())

print(ans[0])

[answer0]

このように回答コード例がここに表示されます。
各問題の回答コード例を表示するときはprintの前の
#を消して実行して下さい。

コード例をセル内にコピー&ペーストし
実行すると、正解のデータが表示されます

# Pandas基礎 (1 - 13)

In [2]:
# 【1】
# dfに読み込んだデータの最初の5行を表示
#print(ans[1]) #回答表示
df = initialize1() #初期化

df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [5]:
# 【2】
# dfに読み込んだデータの最後の5行を表示
# print(ans[2]) #回答表示
df = initialize1() #初期化

df.tail()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1304,3,0,"Zabour, Miss. Hileni",female,14.5,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [10]:
# 【3】
# dfのDataFrameサイズを確認
# print(ans[3]) #回答表示
df = initialize1() #初期化

df.shape

[answer3]

df.shape

(1309, 14)

In [13]:
# 【4】
# inputフォルダ内のdata1.csvファイルを
# 読み込みdf2に格納して、最初の5行を表示
# print(ans[4]) #回答表示

df2 = pd.read_csv("../input/data1.csv")
df2.head()

  name  class  English  Mathematics  History
0    A      1       80           55       65
1    B      1       55          100       83
2    C      2       65           70       95
3    D      1       40           63       70
4    E      2       76           82       79

In [2]:
# 【5】
# dfのfareの列で昇順に並び替えて表示
#print(ans[5]) #回答表示
df = initialize1() #初期化

df_sort = df.sort_values('fare')
print(df_sort)

      pclass  survived                                               name  \
363        2         0                              Campbell, Mr. William
223        1         0                      Parr, Mr. William Henry Marsh
170        1         1                            Ismay, Mr. Joseph Bruce
1254       3         1                       Tornquist, Mr. William Henry
896        3         0                                Johnson, Mr. Alfred
898        3         0                    Johnson, Mr. William Cahoone Jr
70         1         0              Chisholm, Mr. Roderick Robert Crispin
384        2         0                     Cunningham, Mr. Alfred Fleming
581        2         0                         Watson, Mr. Ennis Hastings
150        1         0                              Harrison, Mr. William
234        1         0                    Reuchlin, Jonkheer. John George
7          1         0                             Andrews, Mr. Thomas Jr
528        2         0                        Parkes, Mr. Francis "Frank"
473        2         0                               Knight, Mr. Robert J
410        2         0                   Frost, Mr. Anthony Wood "Archie"
963        3         0                                Leonard, Mr. Lionel
125        1         0                                   Fry, Mr. Richard
1082       3         1                          Olsen, Master. Artur Karl
673        3         0                                Betros, Mr. Tannous
51         1         0                           Carlsson, Mr. Frans Olof
1068       3         0                          Nysveen, Mr. Johan Hansen
1242       3         0                                   Thomas, Mr. John
1241       3         0                              Thomas, Mr. Charles P
960        3         0                         Lemberopolous, Mr. Peter L
868        3         0                   Holm, Mr. John Fredrik Alexander
1288       3         0                          Wiklund, Mr. Jakob Alfred
1289       3         0                            Wiklund, Mr. Karl Johan
888        3         0                         Johanson, Mr. Jakob Alfred
694        3         0                                Burke, Mr. Jeremiah
859        3         0                       Hegarty, Miss. Hanora "Nora"
...      ...       ...                                                ...
24         1         1                                  Bird, Miss. Ellen
285        1         0                                 Straus, Mr. Isidor
286        1         0             Straus, Mrs. Isidor (Rosalie Ida Blun)
106        1         0                                 Farthing, Mr. John
10         1         0                             Astor, Col. John Jacob
11         1         1  Astor, Mrs. John Jacob (Madeleine Talmadge Force)
23         1         1                              Bidois, Miss. Rosalie
237        1         0                                Robbins, Mr. Victor
103        1         1                      Endres, Miss. Caroline Louise
97         1         1  Douglas, Mrs. Frederick Charles (Mary Helene B...
17         1         1    Baxter, Mrs. James (Helene DeLaudeniere Chaput)
16         1         0                           Baxter, Mr. Quigg Edmond
35         1         1                           Bowen, Miss. Grace Scott
66         1         1                        Chaudanson, Miss. Victorine
253        1         1    Ryerson, Mrs. Arthur Larned (Emily Maria Borie)
252        1         0                         Ryerson, Mr. Arthur Larned
251        1         1              Ryerson, Miss. Susan Parker "Suzette"
250        1         1                         Ryerson, Miss. Emily Borie
249        1         1                        Ryerson, Master. John Borie
112        1         1                         Fortune, Miss. Ethel Flora
113        1         1                         Fortune, Miss. Mabel Helen
114        1         0                     Fortune, Mr. Charles Alexander
115        1         0                                  Fortune, Mr. Mark
111        1         1                     Fortune, Miss. Alice Elizabeth
116        1         1                Fortune, Mrs. Mark (Mary McDougald)
302        1         1                                   Ward, Miss. Anna
50         1         1  Cardeza, Mrs. James Warburton Martinez (Charlo...
49         1         1                 Cardeza, Mr. Thomas Drake Martinez
183        1         1                             Lesurer, Mr. Gustave J
1225       3         0                                 Storey, Mr. Thomas

         sex   age  sibsp  parch    ticket      fare            cabin  \
363     male   NaN      0      0    239853    0.0000              NaN
223     male   NaN      0      0    112052    0.0000              NaN
170     male  49.0      0      0    112058    0.0000      B52 B54 B56
1254    male  25.0      0      0      LINE    0.0000              NaN
896     male  49.0      0      0      LINE    0.0000              NaN
898     male  19.0      0      0      LINE    0.0000              NaN
70      male   NaN      0      0    112051    0.0000              NaN
384     male   NaN      0      0    239853    0.0000              NaN
581     male   NaN      0      0    239856    0.0000              NaN
150     male  40.0      0      0    112059    0.0000              B94
234     male  38.0      0      0     19972    0.0000              NaN
7       male  39.0      0      0    112050    0.0000              A36
528     male   NaN      0      0    239853    0.0000              NaN
473     male   NaN      0      0    239855    0.0000              NaN
410     male   NaN      0      0    239854    0.0000              NaN
963     male  36.0      0      0      LINE    0.0000              NaN
125     male   NaN      0      0    112058    0.0000             B102
1082    male   9.0      0      1   C 17368    3.1708              NaN
673     male  20.0      0      0      2648    4.0125              NaN
51      male  33.0      0      0       695    5.0000      B51 B53 B55
1068    male  61.0      0      0    345364    6.2375              NaN
1242    male   NaN      0      0      2681    6.4375              NaN
1241    male   NaN      1      0      2621    6.4375              NaN
960     male  34.5      0      0      2683    6.4375              NaN
868     male  43.0      0      0    C 7075    6.4500              NaN
1288    male  18.0      1      0   3101267    6.4958              NaN
1289    male  21.0      1      0   3101266    6.4958              NaN
888     male  34.0      0      0   3101264    6.4958              NaN
694     male  19.0      0      0    365222    6.7500              NaN
859   female  18.0      0      0    365226    6.7500              NaN
...      ...   ...    ...    ...       ...       ...              ...
24    female  29.0      0      0  PC 17483  221.7792              C97
285     male  67.0      1      0  PC 17483  221.7792          C55 C57
286   female  63.0      1      0  PC 17483  221.7792          C55 C57
106     male   NaN      0      0  PC 17483  221.7792              C95
10      male  47.0      1      0  PC 17757  227.5250          C62 C64
11    female  18.0      1      0  PC 17757  227.5250          C62 C64
23    female  42.0      0      0  PC 17757  227.5250              NaN
237     male   NaN      0      0  PC 17757  227.5250              NaN
103   female  38.0      0      0  PC 17757  227.5250              C45
97    female  27.0      1      1  PC 17558  247.5208          B58 B60
17    female  50.0      0      1  PC 17558  247.5208          B58 B60
16      male  24.0      0      1  PC 17558  247.5208          B58 B60
35    female  45.0      0      0  PC 17608  262.3750              NaN
66    female  36.0      0      0  PC 17608  262.3750              B61
253   female  48.0      1      3  PC 17608  262.3750  B57 B59 B63 B66
252     male  61.0      1      3  PC 17608  262.3750  B57 B59 B63 B66
251   female  21.0      2      2  PC 17608  262.3750  B57 B59 B63 B66
250   female  18.0      2      2  PC 17608  262.3750  B57 B59 B63 B66
249     male  13.0      2      2  PC 17608  262.3750  B57 B59 B63 B66
112   female  28.0      3      2     19950  263.0000      C23 C25 C27
113   female  23.0      3      2     19950  263.0000      C23 C25 C27
114     male  19.0      3      2     19950  263.0000      C23 C25 C27
115     male  64.0      1      4     19950  263.0000      C23 C25 C27
111   female  24.0      3      2     19950  263.0000      C23 C25 C27
116   female  60.0      1      4     19950  263.0000      C23 C25 C27
302   female  35.0      0      0  PC 17755  512.3292              NaN
50    female  58.0      0      1  PC 17755  512.3292      B51 B53 B55
49      male  36.0      0      1  PC 17755  512.3292      B51 B53 B55
183     male  35.0      0      0  PC 17755  512.3292             B101
1225    male  60.5      0      0      3701       NaN              NaN

     embarked boat   body                                       home.dest
363         S  NaN    NaN                                         Belfast
223         S  NaN    NaN                                         Belfast
170         S    C    NaN                                       Liverpool
1254        S   15    NaN                                             NaN
896         S  NaN    NaN                                             NaN
898         S  NaN    NaN                                             NaN
70          S  NaN    NaN                    Liverpool, England / Belfast
384         S  NaN    NaN                                         Belfast
581         S  NaN    NaN                                         Belfast
150         S  NaN  110.0                                             NaN
234         S  NaN    NaN                          Rotterdam, Netherlands
7           S  NaN    NaN                                     Belfast, NI
528         S  NaN    NaN                                         Belfast
473         S  NaN    NaN                                         Belfast
410         S  NaN    NaN                                         Belfast
963         S  NaN    NaN                                             NaN
125         S  NaN    NaN                                             NaN
1082        S   13    NaN                                             NaN
673         C  NaN    NaN                                           Syria
51          S  NaN    NaN                                    New York, NY
1068        S  NaN    NaN                                             NaN
1242        C  NaN    NaN                                             NaN
1241        C  NaN    NaN                                             NaN
960         C  NaN  196.0                                             NaN
868         S  NaN    NaN                                             NaN
1288        S  NaN  314.0                                             NaN
1289        S  NaN    NaN                                             NaN
888         S  NaN  143.0                                             NaN
694         Q  NaN    NaN                Co Cork, Ireland Charlestown, MA
859         Q  NaN    NaN                                             NaN
...       ...  ...    ...                                             ...
24          S    8    NaN                                             NaN
285         S  NaN   96.0                                    New York, NY
286         S  NaN    NaN                                    New York, NY
106         S  NaN    NaN                                             NaN
10          C  NaN  124.0                                    New York, NY
11          C    4    NaN                                    New York, NY
23          C    4    NaN                                             NaN
237         C  NaN    NaN                                             NaN
103         C    4    NaN                                    New York, NY
97          C    6    NaN                                    Montreal, PQ
17          C    6    NaN                                    Montreal, PQ
16          C  NaN    NaN                                    Montreal, PQ
35          C    4    NaN                                 Cooperstown, NY
66          C    4    NaN                                             NaN
253         C    4    NaN                 Haverford, PA / Cooperstown, NY
252         C  NaN    NaN                 Haverford, PA / Cooperstown, NY
251         C    4    NaN                 Haverford, PA / Cooperstown, NY
250         C    4    NaN                 Haverford, PA / Cooperstown, NY
249         C    4    NaN                 Haverford, PA / Cooperstown, NY
112         S   10    NaN                                    Winnipeg, MB
113         S   10    NaN                                    Winnipeg, MB
114         S  NaN    NaN                                    Winnipeg, MB
115         S  NaN    NaN                                    Winnipeg, MB
111         S   10    NaN                                    Winnipeg, MB
116         S   10    NaN                                    Winnipeg, MB
302         C    3    NaN                                             NaN
50          C    3    NaN                    Germantown, Philadelphia, PA
49          C    3    NaN  Austria-Hungary / Germantown, Philadelphia, PA
183         C    3    NaN                                             NaN
1225        S  NaN  261.0                                             NaN

[1309 rows x 14 columns]

In [3]:
# 【6】
# df_copyにdfをコピーして、最初の5行を表示
#print(ans[6]) #回答表示
df = initialize1() #初期化

df_copy = df
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [6]:
# 【7】
# ① dfの各列のデータ型を確認
# ② dfのcabinの列のデータ型を確認
#print(ans[7]) #回答表示
df = initialize1() #初期化

print(df.dtypes)
print(df["cabin"].dtype)

pclass         int64
survived       int64
name          object
sex           object
age          float64
sibsp          int64
parch          int64
ticket        object
fare         float64
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object
object

In [8]:
# 【8】
# ① dfのpclassの列のデータ型をdtypeで確認
# ② 数値型から文字型に変換し、データ型をdtypeで確認
# print(ans[8]) #回答表示
df = initialize1() #初期化

print(df["pclass"].dtype)
df_copy = df.astype({"pclass": str})
print(df_copy["pclass"].dtype)

int64
object

In [11]:
# 【9】
# dfのレコード数(行数)を確認
# print(ans[9]) #回答表示
df = initialize1() #初期化

len(df)

1309

In [14]:
# 【10】
# dfのレコード数(行数)、各列のデータ型、欠損値の有無を確認
# print(ans[10]) #回答表示
df = initialize1() #初期化

df.info()
"""
# 誤答
print(len(df))
print(df.dtypes)
print(df.isnull().all())
"""

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
pclass       1309 non-null int64
survived     1309 non-null int64
name         1309 non-null object
sex          1309 non-null object
age          1046 non-null float64
sibsp        1309 non-null int64
parch        1309 non-null int64
ticket       1309 non-null object
fare         1308 non-null float64
cabin        295 non-null object
embarked     1307 non-null object
boat         486 non-null object
body         121 non-null float64
home.dest    745 non-null object
dtypes: float64(3), int64(4), object(7)
memory usage: 143.2+ KB

'\n# 誤答\nprint(len(df))\nprint(df.dtypes)\nprint(df.isnull().all())\n'

In [16]:
# 【11】
# dfのsex,cabinの列の要素を確認
# print(ans[11]) #回答表示
df = initialize1() #初期化


print(df["sex"].unique())
print(df["cabin"].unique())

['female' 'male']
['B5' 'C22 C26' 'E12' 'D7' 'A36' 'C101' nan 'C62 C64' 'B35' 'A23'
 'B58 B60' 'D15' 'C6' 'D35' 'C148' 'C97' 'B49' 'C99' 'C52' 'T' 'A31' 'C7'
 'C103' 'D22' 'E33' 'A21' 'B10' 'B4' 'E40' 'B38' 'E24' 'B51 B53 B55'
 'B96 B98' 'C46' 'E31' 'E8' 'B61' 'B77' 'A9' 'C89' 'A14' 'E58' 'E49' 'E52'
 'E45' 'B22' 'B26' 'C85' 'E17' 'B71' 'B20' 'A34' 'C86' 'A16' 'A20' 'A18'
 'C54' 'C45' 'D20' 'A29' 'C95' 'E25' 'C111' 'C23 C25 C27' 'E36' 'D34'
 'D40' 'B39' 'B41' 'B102' 'C123' 'E63' 'C130' 'B86' 'C92' 'A5' 'C51' 'B42'
 'C91' 'C125' 'D10 D12' 'B82 B84' 'E50' 'D33' 'C83' 'B94' 'D49' 'D45'
 'B69' 'B11' 'E46' 'C39' 'B18' 'D11' 'C93' 'B28' 'C49' 'B52 B54 B56' 'E60'
 'C132' 'B37' 'D21' 'D19' 'C124' 'D17' 'B101' 'D28' 'D6' 'D9' 'B80' 'C106'
 'B79' 'C47' 'D30' 'C90' 'E38' 'C78' 'C30' 'C118' 'D36' 'D48' 'D47' 'C105'
 'B36' 'B30' 'D43' 'B24' 'C2' 'C65' 'B73' 'C104' 'C110' 'C50' 'B3' 'A24'
 'A32' 'A11' 'A10' 'B57 B59 B63 B66' 'C28' 'E44' 'A26' 'A6' 'A7' 'C31'
 'A19' 'B45' 'E34' 'B78' 'B50' 'C87' 'C116' 'C55 C57' 'D50' 'E68' 'E67'
 'C126' 'C68' 'C70' 'C53' 'B19' 'D46' 'D37' 'D26' 'C32' 'C80' 'C82' 'C128'
 'E39 E41' 'D' 'F4' 'D56' 'F33' 'E101' 'E77' 'F2' 'D38' 'F' 'F G63'
 'F E57' 'F E46' 'F G73' 'E121' 'F E69' 'E10' 'G6' 'F38']

In [20]:
# 【12】
# dfの列名一覧をlist形式で表示
# print(ans[12]) #回答表示
df = initialize1() #初期化

print(df.columns.tolist())

['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest']

In [22]:
# 【13】
# dfのインデックス一覧をndaaray形式で表示
# print(ans[13]) #回答表示
df = initialize1() #初期化#

print(df.columns.values)

['pclass' 'survived' 'name' 'sex' 'age' 'sibsp' 'parch' 'ticket' 'fare'
 'cabin' 'embarked' 'boat' 'body' 'home.dest']

# データ抽出 (14 - 32)

In [ ]:
# 【14】
# dfのnameの列のみ表示
#print(ans[14]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【15】
# dfのnameとsexの列のみ表示
#print(ans[15]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【16】
# dfのindex(行)の4行目までを表示
#print(ans[16]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【17】
# dfのindex(行)の4行目から10行目までを表示
#print(ans[17]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【18】
# locを使ってdf全体を表示
#print(ans[18]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【19】
# locを使ってdfのfare列をすべて表示
#print(ans[19]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【20】
# locを使ってdfのfare列の10のラベルまで表示
#print(ans[20]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【21】
# locを使ってdfのnameとticketの列をすべて表示
#print(ans[21]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【22】
# locを使ってdfのnameからcabinまでの列をすべて表示
#print(ans[22]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【23】
# ilocを使ってdfのage列を5行目まで表示
#print(ans[23]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【24】
# dfのname,age,sexの列のみ抽出しdf_copyに格納
# その後outputフォルダにcsvファイルで出力
# 出力ファイル名はsample.csv
#print(ans[24]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【25】
# dfのage列の値が30以上のデータのみ抽出
#print(ans[25]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【26】
# dfのsex列がfemaleのデータのみ抽出
#print(ans[26]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【27】
# dfのsex列がfemaleでかつageが40以上のデータのみ抽出
#print(ans[27]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【28】
# queryを用いてdfのsex列がfemaleでかつageが40以上のデータのみ抽出
#print(ans[28]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【29】
# dfのname列に文字列「Mrs」が含まれるデータを表示
#print(ans[29]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【30】
# dfの中で文字列型の列のみを表示
#print(ans[30]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【31】
# dfの各列の要素数の確認
#print(ans[31]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【32】
# dfのembarked列の要素と出現回数の確認
#print(ans[32]) #回答表示
df = initialize1() #初期化

# データ加工 (33 - 58)

In [ ]:
# 【33】
# dfのindex名が「3」のage列を
# 30から40に変更し、先頭の5行を表示
#print(ans[33]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【34】
# dfのsex列にてmale→0、femlae→1に
# 変更し、先頭の5行を表示
#print(ans[34]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【35】
# dfのfare列に100を足して、
# 先頭の5行を表示
#print(ans[35]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【36】
# dfのfare列に2を掛けて、
# 先頭の5行を表示
#print(ans[36]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【37】
# dfのfare列を小数点以下で丸めて、先頭の5行を表示
#print(ans[37]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【38】
# dfに列名「test」で値がすべて1の
# カラムを追加し、先頭の5行を表示
#print(ans[38]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【39】
# dfにcabinとembarkedの列を「_」で
# 結合した列を追加(列名は「test」)し、
# 先頭の5行を表示
#print(ans[39]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【40】
# dfにageとembarkedの列を「_」で
# 結合した列を追加(列名は「test」)し、
# 先頭の5行を表示
#print(ans[40]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【41】
# dfからbodyの列を削除し、最初の5行を表示
#print(ans[41]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【42】
# dfからインデックス名「3」の行を削除し、最初の5行を表示
#print(ans[42]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【43】
# df2の列名を'name', 'class', 'Biology', 'Physics', 'Chemistry'に変更
# df2の最初の5行を表示
#print(ans[43]) #回答表示
df2 = initialize2() #初期化

In [ ]:
# 【44】
# df2の列名を'English'をBiology'に変更
# df2の最初の5行を表示
#print(ans[44]) #回答表示
df2 = initialize2() #初期化

In [ ]:
# 【45】
# df2のインデックス名「1」を「10」に変更
# df2の最初の5行を表示
#print(ans[45]) #回答表示
df2 = initialize2() #初期化

In [ ]:
# 【46】
# dfのすべての列の欠損値数を確認
#print(ans[46]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【47】
# dfのage列の欠損値に30を代入
# その後、ageの欠損値数を確認
#print(ans[47]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【48】
# dfでひとつでも欠損値がある行を削除
# その後、dfの欠損値数を確認
#print(ans[48]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【49】
# dfのsurvivedの列をndarray形式(配列)で表示
#print(ans[49]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【50】
# dfの行をシャッフルして表示
#print(ans[50]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【51】
# dfの行をシャッフルし、インデックスを振り直して表示
#print(ans[51]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【52】
# ①df2の重複行数をカウント
# ②df2の重複行を削除し、df2を表示
#print(ans[52]) #回答表示
df2 = initialize2() #初期化

In [ ]:
# 【53】
# dfのnameの列をすべて大文字に変換し表示
#print(ans[53]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【54】
# dfのnameの列をすべて小文字に変換し表示
#print(ans[54]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【55】
# dfのsex列に含まれる「female」という単語を
# 「Python」に置換。その後、1行目の
# 「female」が「Python」に置き換わったことを確認
#print(ans[55]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【56】
# dfのname列1行目の「Allen, Miss. Elisabeth Walton」の
# 「Elisabeth」を消去(import reをインポート)
#print(ans[56]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【57】
# df5の都道府県列と市区町村列を空白がないように
# 「_」で結合(新規列名は「test2」)し、先頭5行を表示
# ※df5の「test」列は通常通り結合した場合の結果
#print(ans[57]) #回答表示

In [ ]:
# 【58】
# df2の行と列を入れ替えて表示
#print(ans[58]) #回答表示
df2 = initialize2() #初期化

# マージと連結(59 - 65)

In [ ]:
# 【59】
# df2にdf3を左結合（結合キーはname）し、df2に格納
#print(ans[59]) #回答表示
df2 = initialize2() #初期化

In [ ]:
# 【60】
# df2にdf3を右結合し、df2に格納
#print(ans[60]) #回答表示
df2 = initialize2() #初期化

In [ ]:
# 【61】
# df2にdf3を内部結合し、df2に格納
#print(ans[61]) #回答表示
df2 = initialize2() #初期化

In [ ]:
# 【62】
# df2にdf3を外部結合し、df2に格納
#print(ans[62]) #回答表示
df2 = initialize2() #初期化

In [ ]:
# 【63】
# df2とdf4を列方向に連結し、df2に格納
#print(ans[63]) #回答表示
df2 = initialize2() #初期化

In [ ]:
# 【64】
# df2とdf4を列方向に連結後、重複している
# name列の片方を削除し、df2に格納
#print(ans[64]) #回答表示
df2 = initialize2() #初期化

In [ ]:
# 【65】
# df2とdf4を行方向に連結し、df2に格納
#print(ans[65]) #回答表示
df2 = initialize2() #初期化

# 統計 (66 - 79)

In [ ]:
# 【66】
# dfのage列の平均値を確認
#print(ans[66]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【67】
# dfのage列の中央値を確認
#print(ans[67]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【68】
# ①df2の生徒ごとの合計点（行方向の合計）
# ②df2の科目ごとの点数の総和（列方向の合計）
#print(ans[68]) #回答表示
df2 = initialize2() #初期化

In [ ]:
# 【69】
# df2のEnglishで得点の最大値
#print(ans[69]) #回答表示
df2 = initialize2() #初期化

In [ ]:
# 【70】
# df2のEnglishで得点の最小値
#print(ans[70]) #回答表示
df2 = initialize2() #初期化

In [ ]:
# 【71】
# df2においてclassでグルーピングし、クラスごとの科目の
# 最大値、最小値、平均値を求める(name列は削除しておく)
#print(ans[71]) #回答表示
df2 = initialize2() #初期化

In [ ]:
# 【72】
# dfの基本統計量を確認(describe)
#print(ans[72]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【73】
# dfの各列間の(Pearson)相関係数を確認
#print(ans[73]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【74】
# scikit-learnを用いてdf2のEnglish、Mathematics、History列を標準化する
# (from sklearn.preprocessing import StandardScalerをインポート)
#print(ans[74]) #回答表示
df2 = initialize2() #初期化

In [ ]:
# 【75】
# scikit-learnを用いてdf2のEnglish列を標準化する
# (from sklearn.preprocessing import StandardScalerをインポート)
#print(ans[75]) #回答表示
df2 = initialize2() #初期化

In [ ]:
# 【76】
# scikit-learnを用いてdf2のEnglish、Mathematics、History列を
# Min-Maxスケーリングする
# (from sklearn.preprocessing import StandardScalerをインポート)
#print(ans[76]) #回答表示
df2 = initialize2() #初期化

In [ ]:
# 【77】
# dfのfare列の最大値、最小値の行名を取得
#print(ans[77]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【78】
# dfのfare列の0、25、50、75、100パーセンタイルを取得
#print(ans[78]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【79】
# ①dfのage列の最頻値を取得
# ②value_counts()にてage列の要素数を
# 確認し、①の結果の妥当性を確認
#print(ans[79]) #回答表示
df = initialize1() #初期化

# ラベリング (80 - 81)

In [ ]:
# 【80】
# dfのsex列をラベルエンコーディングし、
# dfの先頭5行を表示
# (from sklearn.preprocessing import LabelEncoderをインポート)
#print(ans[80]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【81】
# dfのsex列をOne-hotエンコーディングし、
# dfの先頭5行を表示
#print(ans[81]) #回答表示
df = initialize1() #初期化

# Pandasプロット (82 - 89)
Pandasプロットの機能については以下のサイトの説明が分かりやすいです  
[自調自考の旅](https://own-search-and-study.xyz/2016/08/03/pandas%E3%81%AEplot%E3%81%AE%E5%85%A8%E5%BC%95%E6%95%B0%E3%82%92%E4%BD%BF%E3%81%84%E3%81%93%E3%81%AA%E3%81%99/)

In [ ]:
# 【82】
# dfのすべての数値列のヒストグラムを表示
#print(ans[82]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【83】
# dfのage列をヒストグラムで表示
#print(ans[83]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【84】
# df2のname列の要素ごとの3科目合計得点を棒グラフで表示
#print(ans[84]) #回答表示
df2 = initialize2() #初期化

In [ ]:
# 【85】
# df2のname列の要素ごとの3科目を棒グラフで
# 並べて表示
#print(ans[85]) #回答表示
df2 = initialize2() #初期化

In [ ]:
# 【86】
# df2のname列の要素ごとの3科目を積み上げ棒グラフで表示
#print(ans[86]) #回答表示
df2 = initialize2() #初期化

In [ ]:
# 【87】
# dfの各列間の散布図を表示
# (from pandas.plotting import scatter_matrixをインポート)
#print(ans[87]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【88】
# dfのage列とfare列で散布図を作成
#print(ans[88]) #回答表示
df = initialize1() #初期化

In [ ]:
# 【89】
# 【88】で描画したグラフに「age-fare scatter」という
# グラフタイトルをつける
#print(ans[89]) #回答表示
df = initialize1() #初期化

# タイタニック号の生存者予測 (90 - 100)  
これまで触れてきたタイタニック号の乗客データを使用して、乗客の生存有無を  
予測してみます。  
  
※90～100については順番通りにやらないと上手く動作しません

In [ ]:
# 【90】ラベルエンコーディング
# df_copyのsexとembarked列をラベルエンコーディング
# (from sklearn.preprocessing import LabelEncoderをインポート)
# (df_copyはdfをコピーしたもの)
#print(ans[90]) #回答表示
df_copy =df.copy()

In [ ]:
# 【91】欠損値確認
# df_copyの欠損値を確認
#print(ans[91]) #回答表示

In [ ]:
# 【92】欠損値補完
# df_copyのage、fare列の欠損値を各列の平均値で補完
#print(ans[92]) #回答表示

In [ ]:
# 【93】不要列の削除
# df_copyの中で機械学習で使用しない不要な行を削除
# (name, ticket, cabin, boat, body, home.destを削除)
#print(ans[93]) #回答表示

In [ ]:
# 【94】ndarray形式への変換
# ①df_copyのpclass、age、sex、fare、embarkedの列を抽出し、ndarray形式に変換
# ②df_copyのsurvivedの列を抽出し、ndarray形式に変換
# (①をfeatures、②をtargetという変数にそれぞれ格納)
#print(ans[94]) #回答表示

In [ ]:
# 【95】学習データとテストデータに分割
# 【94】で作成したfeatrues、targetを学習データとテストデータに分割
# (from sklearn.model_selection import  train_test_splitをインポート)
# ※分割時のパラメータは次を指定 test_size=0.3 random_state=0
#print(ans[95]) #回答表示

In [ ]:
# 【96】学習の実行
# 学習データ(features、target)を用いランダムフォレストにて学習を実行
# (from sklearn.ensemble import RandomForestClassifierをインポート)
# ※パラメータは次を指定 n_estimators=100 random_state=0
#print(ans[96]) #回答表示

In [ ]:
# 【97】予測の実行
# test_Xデータの乗客の生存を予測
#print(ans[97]) #回答表示

In [ ]:
# 【98】予測精度の確認
# 予測結果がtest_y(生存有無の答え)とどれぐらい
# 整合していたかを確認(評価指標はaccuracy)
# (from sklearn.metrics import accuracy_scoreをインポート)
#print(ans[98]) #回答表示

In [ ]:
# 【99】重要度の確認
# 学習における各列(特徴量)の
# 重要度を表示
#print(ans[99]) #回答表示

In [ ]:
# 【100】予測結果のcsv出力
# test_Xの予測結果をcsvでoutputフォルダに出力(ファイル名は「submission.csv」)
# (headerは不要)
#print(ans[100]) #回答表示

# ノックお疲れ様でした
各セルのoutput表示をすべてクリアにしたい場合は、ツールバーの  
「Kernel」→「Restart & Clear Output」を実行して下さい。